; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-7-14)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	p0-1 - location
	p0-2 - location
	p2-5 - location
	p2-11 - location
	p3-2 - location
	p4-3 - location
	p5-7 - location
	p5-8 - location
	p5-11 - location
	p6-2 - location
	p6-4 - location
	p6-9 - location
	p7-6 - location
	p8-6 - location
	p9-3 - location
	p9-7 - location
	p10-2 - location
	p11-7 - location
	p11-10 - location
	)
	(:init
	(at driver1 s7)
	(at driver2 s0)
	(at driver3 s11)
	(at truck1 s11)
	(empty truck1)
	(at truck2 s0)
	(empty truck2)
	(at truck3 s8)
	(empty truck3)
	(at truck4 s3)
	(empty truck4)
	(at truck5 s2)
	(empty truck5)
	(at truck6 s11)
	(empty truck6)
	(at truck7 s0)
	(empty truck7)
	(at package1 s5)
	(at package2 s8)
	(at package3 s1)
	(at package4 s6)
	(at package5 s8)
	(at package6 s4)
	(at package7 s6)
	(at package8 s9)
	(at package9 s8)
	(at package10 s5)
	(at package11 s3)
	(at package12 s0)
	(at package13 s1)
	(at package14 s8)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 64)
	(= (time-to-walk p0-1 s0) 64)
	(= (time-to-walk s1 p0-1) 10)
	(= (time-to-walk p0-1 s1) 10)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 40)
	(= (time-to-walk p0-2 s0) 40)
	(= (time-to-walk s2 p0-2) 19)
	(= (time-to-walk p0-2 s2) 19)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(= (time-to-walk s2 p2-5) 50)
	(= (time-to-walk p2-5 s2) 50)
	(= (time-to-walk s5 p2-5) 46)
	(= (time-to-walk p2-5 s5) 46)
	(path s2 p2-11)
	(path p2-11 s2)
	(path s11 p2-11)
	(path p2-11 s11)
	(= (time-to-walk s2 p2-11) 80)
	(= (time-to-walk p2-11 s2) 80)
	(= (time-to-walk s11 p2-11) 2)
	(= (time-to-walk p2-11 s11) 2)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(= (time-to-walk s3 p3-2) 77)
	(= (time-to-walk p3-2 s3) 77)
	(= (time-to-walk s2 p3-2) 75)
	(= (time-to-walk p3-2 s2) 75)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 85)
	(= (time-to-walk p4-3 s4) 85)
	(= (time-to-walk s3 p4-3) 30)
	(= (time-to-walk p4-3 s3) 30)
	(path s5 p5-7)
	(path p5-7 s5)
	(path s7 p5-7)
	(path p5-7 s7)
	(= (time-to-walk s5 p5-7) 25)
	(= (time-to-walk p5-7 s5) 25)
	(= (time-to-walk s7 p5-7) 52)
	(= (time-to-walk p5-7 s7) 52)
	(path s5 p5-8)
	(path p5-8 s5)
	(path s8 p5-8)
	(path p5-8 s8)
	(= (time-to-walk s5 p5-8) 81)
	(= (time-to-walk p5-8 s5) 81)
	(= (time-to-walk s8 p5-8) 80)
	(= (time-to-walk p5-8 s8) 80)
	(path s5 p5-11)
	(path p5-11 s5)
	(path s11 p5-11)
	(path p5-11 s11)
	(= (time-to-walk s5 p5-11) 96)
	(= (time-to-walk p5-11 s5) 96)
	(= (time-to-walk s11 p5-11) 35)
	(= (time-to-walk p5-11 s11) 35)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(= (time-to-walk s6 p6-2) 18)
	(= (time-to-walk p6-2 s6) 18)
	(= (time-to-walk s2 p6-2) 23)
	(= (time-to-walk p6-2 s2) 23)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(= (time-to-walk s6 p6-4) 36)
	(= (time-to-walk p6-4 s6) 36)
	(= (time-to-walk s4 p6-4) 99)
	(= (time-to-walk p6-4 s4) 99)
	(path s6 p6-9)
	(path p6-9 s6)
	(path s9 p6-9)
	(path p6-9 s9)
	(= (time-to-walk s6 p6-9) 24)
	(= (time-to-walk p6-9 s6) 24)
	(= (time-to-walk s9 p6-9) 6)
	(= (time-to-walk p6-9 s9) 6)
	(path s7 p7-6)
	(path p7-6 s7)
	(path s6 p7-6)
	(path p7-6 s6)
	(= (time-to-walk s7 p7-6) 27)
	(= (time-to-walk p7-6 s7) 27)
	(= (time-to-walk s6 p7-6) 39)
	(= (time-to-walk p7-6 s6) 39)
	(path s8 p8-6)
	(path p8-6 s8)
	(path s6 p8-6)
	(path p8-6 s6)
	(= (time-to-walk s8 p8-6) 92)
	(= (time-to-walk p8-6 s8) 92)
	(= (time-to-walk s6 p8-6) 95)
	(= (time-to-walk p8-6 s6) 95)
	(path s9 p9-3)
	(path p9-3 s9)
	(path s3 p9-3)
	(path p9-3 s3)
	(= (time-to-walk s9 p9-3) 7)
	(= (time-to-walk p9-3 s9) 7)
	(= (time-to-walk s3 p9-3) 33)
	(= (time-to-walk p9-3 s3) 33)
	(path s9 p9-7)
	(path p9-7 s9)
	(path s7 p9-7)
	(path p9-7 s7)
	(= (time-to-walk s9 p9-7) 98)
	(= (time-to-walk p9-7 s9) 98)
	(= (time-to-walk s7 p9-7) 71)
	(= (time-to-walk p9-7 s7) 71)
	(path s10 p10-2)
	(path p10-2 s10)
	(path s2 p10-2)
	(path p10-2 s2)
	(= (time-to-walk s10 p10-2) 42)
	(= (time-to-walk p10-2 s10) 42)
	(= (time-to-walk s2 p10-2) 38)
	(= (time-to-walk p10-2 s2) 38)
	(path s11 p11-7)
	(path p11-7 s11)
	(path s7 p11-7)
	(path p11-7 s7)
	(= (time-to-walk s11 p11-7) 89)
	(= (time-to-walk p11-7 s11) 89)
	(= (time-to-walk s7 p11-7) 91)
	(= (time-to-walk p11-7 s7) 91)
	(path s11 p11-10)
	(path p11-10 s11)
	(path s10 p11-10)
	(path p11-10 s10)
	(= (time-to-walk s11 p11-10) 83)
	(= (time-to-walk p11-10 s11) 83)
	(= (time-to-walk s10 p11-10) 68)
	(= (time-to-walk p11-10 s10) 68)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 92)
	(= (time-to-drive s3 s0) 92)
	(link s0 s10)
	(link s10 s0)
	(= (time-to-drive s0 s10) 59)
	(= (time-to-drive s10 s0) 59)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 43)
	(= (time-to-drive s3 s1) 43)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 76)
	(= (time-to-drive s6 s1) 76)
	(link s1 s9)
	(link s9 s1)
	(= (time-to-drive s1 s9) 89)
	(= (time-to-drive s9 s1) 89)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 67)
	(= (time-to-drive s6 s2) 67)
	(link s2 s11)
	(link s11 s2)
	(= (time-to-drive s2 s11) 27)
	(= (time-to-drive s11 s2) 27)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 69)
	(= (time-to-drive s8 s3) 69)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 46)
	(= (time-to-drive s6 s4) 46)
	(link s4 s8)
	(link s8 s4)
	(= (time-to-drive s4 s8) 23)
	(= (time-to-drive s8 s4) 23)
	(link s4 s9)
	(link s9 s4)
	(= (time-to-drive s4 s9) 4)
	(= (time-to-drive s9 s4) 4)
	(link s4 s10)
	(link s10 s4)
	(= (time-to-drive s4 s10) 63)
	(= (time-to-drive s10 s4) 63)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 46)
	(= (time-to-drive s1 s5) 46)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 40)
	(= (time-to-drive s2 s5) 40)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 62)
	(= (time-to-drive s6 s5) 62)
	(link s5 s11)
	(link s11 s5)
	(= (time-to-drive s5 s11) 69)
	(= (time-to-drive s11 s5) 69)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 46)
	(= (time-to-drive s0 s6) 46)
	(link s6 s8)
	(link s8 s6)
	(= (time-to-drive s6 s8) 89)
	(= (time-to-drive s8 s6) 89)
	(link s7 s1)
	(link s1 s7)
	(= (time-to-drive s7 s1) 8)
	(= (time-to-drive s1 s7) 8)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 37)
	(= (time-to-drive s5 s7) 37)
	(link s7 s11)
	(link s11 s7)
	(= (time-to-drive s7 s11) 84)
	(= (time-to-drive s11 s7) 84)
	(link s8 s0)
	(link s0 s8)
	(= (time-to-drive s8 s0) 15)
	(= (time-to-drive s0 s8) 15)
	(link s8 s5)
	(link s5 s8)
	(= (time-to-drive s8 s5) 69)
	(= (time-to-drive s5 s8) 69)
	(link s8 s7)
	(link s7 s8)
	(= (time-to-drive s8 s7) 82)
	(= (time-to-drive s7 s8) 82)
	(link s9 s0)
	(link s0 s9)
	(= (time-to-drive s9 s0) 85)
	(= (time-to-drive s0 s9) 85)
	(link s9 s5)
	(link s5 s9)
	(= (time-to-drive s9 s5) 11)
	(= (time-to-drive s5 s9) 11)
	(link s10 s3)
	(link s3 s10)
	(= (time-to-drive s10 s3) 19)
	(= (time-to-drive s3 s10) 19)
	(link s10 s8)
	(link s8 s10)
	(= (time-to-drive s10 s8) 73)
	(= (time-to-drive s8 s10) 73)
	(link s10 s9)
	(link s9 s10)
	(= (time-to-drive s10 s9) 1)
	(= (time-to-drive s9 s10) 1)
	(link s11 s4)
	(link s4 s11)
	(= (time-to-drive s11 s4) 1)
	(= (time-to-drive s4 s11) 1)
	(link s11 s10)
	(link s10 s11)
	(= (time-to-drive s11 s10) 41)
	(= (time-to-drive s10 s11) 41)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver2 s4)
	(at driver3 s4)
	(at truck2 s7)
	(at truck4 s3)
	(at truck5 s6)
	(at truck6 s0)
	(at truck7 s10)
	(at package1 s5)
	(at package2 s5)
	(at package3 s4)
	(at package4 s4)
	(at package5 s4)
	(at package6 s0)
	(at package7 s3)
	(at package8 s6)
	(at package9 s6)
	(at package10 s6)
	(at package11 s0)
	(at package12 s8)
	(at package13 s10)
	))

(:metric minimize (+ (+ (* 4  (total-time)) (* 3  (driven))) (* 4  (walked))))

)

; plan
1. (board-truck driver2 truck2 s0)
   deleted: (at driver2 s0) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 2 of 20
2. (drive-truck truck2 s0 s9 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s9)
   changed: (driven) from 0 to 85
   goals met: 2 of 20
3. (load-truck package8 truck2 s9)
   deleted: (at package8 s9)
   added: (in package8 truck2)
   goals met: 2 of 20
4. (board-truck driver3 truck6 s11)
   deleted: (at driver3 s11) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 2 of 20
5. (drive-truck truck6 s11 s2 driver3)
   deleted: (at truck6 s11)
   added: (at truck6 s2)
   changed: (driven) from 85 to 112
   goals met: 2 of 20
6. (drive-truck truck2 s9 s0 driver2)
   deleted: (at truck2 s9)
   added: (at truck2 s0)
   changed: (driven) from 112 to 197
   goals met: 2 of 20
7. (load-truck package12 truck2 s0)
   deleted: (at package12 s0)
   added: (in package12 truck2)
   goals met: 2 of 20
8. (drive-truck truck2 s0 s3 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (driven) from 197 to 289
   goals met: 2 of 20
9. (load-truck package11 truck2 s3)
   deleted: (at package11 s3)
   added: (in package11 truck2)
   goals met: 2 of 20
10. (drive-truck truck2 s3 s8 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s8)
   changed: (driven) from 289 to 358
   goals met: 2 of 20
11. (unload-truck package12 truck2 s8)
   deleted: (in package12 truck2)
   added: (at package12 s8)
   goals met: 3 of 20
12. (load-truck package2 truck2 s8)
   deleted: (at package2 s8)
   added: (in package2 truck2)
   goals met: 3 of 20
13. (load-truck package5 truck2 s8)
   deleted: (at package5 s8)
   added: (in package5 truck2)
   goals met: 3 of 20
14. (load-truck package9 truck2 s8)
   deleted: (at package9 s8)
   added: (in package9 truck2)
   goals met: 3 of 20
15. (drive-truck truck6 s2 s6 driver3)
   deleted: (at truck6 s2)
   added: (at truck6 s6)
   changed: (driven) from 358 to 425
   goals met: 3 of 20
16. (load-truck package4 truck6 s6)
   deleted: (at package4 s6)
   added: (in package4 truck6)
   goals met: 3 of 20
17. (drive-truck truck6 s6 s1 driver3)
   deleted: (at truck6 s6)
   added: (at truck6 s1)
   changed: (driven) from 425 to 501
   goals met: 3 of 20
18. (load-truck package3 truck6 s1)
   deleted: (at package3 s1)
   added: (in package3 truck6)
   goals met: 3 of 20
19. (load-truck package13 truck6 s1)
   deleted: (at package13 s1)
   added: (in package13 truck6)
   goals met: 3 of 20
20. (drive-truck truck6 s1 s9 driver3)
   deleted: (at truck6 s1)
   added: (at truck6 s9)
   changed: (driven) from 501 to 590
   goals met: 3 of 20
21. (drive-truck truck6 s9 s10 driver3)
   deleted: (at truck6 s9)
   added: (at truck6 s10)
   changed: (driven) from 590 to 591
   goals met: 3 of 20
22. (unload-truck package13 truck6 s10)
   deleted: (in package13 truck6)
   added: (at package13 s10)
   goals met: 4 of 20
23. (drive-truck truck2 s8 s5 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s5)
   changed: (driven) from 591 to 660
   goals met: 4 of 20
24. (unload-truck package2 truck2 s5)
   deleted: (in package2 truck2)
   added: (at package2 s5)
   goals met: 5 of 20
25. (drive-truck truck2 s5 s6 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s6)
   changed: (driven) from 660 to 722
   goals met: 5 of 20
26. (unload-truck package8 truck2 s6)
   deleted: (in package8 truck2)
   added: (at package8 s6)
   goals met: 6 of 20
27. (unload-truck package9 truck2 s6)
   deleted: (in package9 truck2)
   added: (at package9 s6)
   goals met: 7 of 20
28. (load-truck package7 truck2 s6)
   deleted: (at package7 s6)
   added: (in package7 truck2)
   goals met: 7 of 20
29. (drive-truck truck2 s6 s2 driver2)
   deleted: (at truck2 s6)
   added: (at truck2 s2)
   changed: (driven) from 722 to 789
   goals met: 7 of 20
30. (drive-truck truck6 s10 s0 driver3)
   deleted: (at truck6 s10)
   added: (at truck6 s0)
   changed: (driven) from 789 to 848
   goals met: 8 of 20
31. (drive-truck truck2 s2 s11 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s11)
   changed: (driven) from 848 to 875
   goals met: 8 of 20
32. (drive-truck truck2 s11 s4 driver2)
   deleted: (at truck2 s11)
   added: (at truck2 s4)
   changed: (driven) from 875 to 876
   goals met: 8 of 20
33. (load-truck package6 truck2 s4)
   deleted: (at package6 s4)
   added: (in package6 truck2)
   goals met: 8 of 20
34. (unload-truck package5 truck2 s4)
   deleted: (in package5 truck2)
   added: (at package5 s4)
   goals met: 9 of 20
35. (drive-truck truck2 s4 s6 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s6)
   changed: (driven) from 876 to 922
   goals met: 9 of 20
36. (drive-truck truck2 s6 s5 driver2)
   deleted: (at truck2 s6)
   added: (at truck2 s5)
   changed: (driven) from 922 to 984
   goals met: 9 of 20
37. (load-truck package10 truck2 s5)
   deleted: (at package10 s5)
   added: (in package10 truck2)
   goals met: 9 of 20
38. (drive-truck truck2 s5 s2 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s2)
   changed: (driven) from 984 to 1024
   goals met: 9 of 20
39. (drive-truck truck6 s0 s9 driver3)
   deleted: (at truck6 s0)
   added: (at truck6 s9)
   changed: (driven) from 1024 to 1109
   goals met: 8 of 20
40. (drive-truck truck2 s2 s6 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s6)
   changed: (driven) from 1109 to 1176
   goals met: 8 of 20
41. (unload-truck package10 truck2 s6)
   deleted: (in package10 truck2)
   added: (at package10 s6)
   goals met: 9 of 20
42. (drive-truck truck2 s6 s0 driver2)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   changed: (driven) from 1176 to 1222
   goals met: 9 of 20
43. (unload-truck package6 truck2 s0)
   deleted: (in package6 truck2)
   added: (at package6 s0)
   goals met: 10 of 20
44. (unload-truck package11 truck2 s0)
   deleted: (in package11 truck2)
   added: (at package11 s0)
   goals met: 11 of 20
45. (drive-truck truck2 s0 s3 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (driven) from 1222 to 1314
   goals met: 11 of 20
46. (unload-truck package7 truck2 s3)
   deleted: (in package7 truck2)
   added: (at package7 s3)
   goals met: 12 of 20
47. (drive-truck truck2 s3 s8 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s8)
   changed: (driven) from 1314 to 1383
   goals met: 12 of 20
48. (drive-truck truck6 s9 s0 driver3)
   deleted: (at truck6 s9)
   added: (at truck6 s0)
   changed: (driven) from 1383 to 1468
   goals met: 13 of 20
49. (drive-truck truck2 s8 s7 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s7)
   changed: (driven) from 1468 to 1550
   goals met: 14 of 20
50. (drive-truck truck2 s7 s11 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s11)
   changed: (driven) from 1550 to 1634
   goals met: 13 of 20
51. (drive-truck truck6 s0 s9 driver3)
   deleted: (at truck6 s0)
   added: (at truck6 s9)
   changed: (driven) from 1634 to 1719
   goals met: 12 of 20
52. (drive-truck truck2 s11 s2 driver2)
   deleted: (at truck2 s11)
   added: (at truck2 s2)
   changed: (driven) from 1719 to 1746
   goals met: 12 of 20
53. (drive-truck truck6 s9 s4 driver3)
   deleted: (at truck6 s9)
   added: (at truck6 s4)
   changed: (driven) from 1746 to 1750
   goals met: 12 of 20
54. (unload-truck package4 truck6 s4)
   deleted: (in package4 truck6)
   added: (at package4 s4)
   goals met: 13 of 20
55. (unload-truck package3 truck6 s4)
   deleted: (in package3 truck6)
   added: (at package3 s4)
   goals met: 14 of 20
56. (drive-truck truck2 s2 s11 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s11)
   changed: (driven) from 1750 to 1777
   goals met: 14 of 20
57. (drive-truck truck6 s4 s9 driver3)
   deleted: (at truck6 s4)
   added: (at truck6 s9)
   changed: (driven) from 1777 to 1781
   goals met: 14 of 20
58. (drive-truck truck6 s9 s0 driver3)
   deleted: (at truck6 s9)
   added: (at truck6 s0)
   changed: (driven) from 1781 to 1866
   goals met: 15 of 20
59. (disembark-truck driver3 truck6 s0)
   deleted: (driving driver3 truck6)
   added: (at driver3 s0) (empty truck6)
   goals met: 15 of 20
60. (board-truck driver3 truck7 s0)
   deleted: (at driver3 s0) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 15 of 20
61. (drive-truck truck7 s0 s10 driver3)
   deleted: (at truck7 s0)
   added: (at truck7 s10)
   changed: (driven) from 1866 to 1925
   goals met: 16 of 20
62. (drive-truck truck2 s11 s4 driver2)
   deleted: (at truck2 s11)
   added: (at truck2 s4)
   changed: (driven) from 1925 to 1926
   goals met: 16 of 20
63. (disembark-truck driver3 truck7 s10)
   deleted: (driving driver3 truck7)
   added: (at driver3 s10) (empty truck7)
   goals met: 16 of 20
64. (walk driver3 s10 p10-2)
   deleted: (at driver3 s10)
   added: (at driver3 p10-2)
   changed: (walked) from 0 to 42
   goals met: 16 of 20
65. (walk driver3 p10-2 s2)
   deleted: (at driver3 p10-2)
   added: (at driver3 s2)
   changed: (walked) from 42 to 80
   goals met: 16 of 20
66. (board-truck driver3 truck5 s2)
   deleted: (at driver3 s2) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 16 of 20
67. (drive-truck truck5 s2 s11 driver3)
   deleted: (at truck5 s2)
   added: (at truck5 s11)
   changed: (driven) from 1926 to 1953
   goals met: 16 of 20
68. (drive-truck truck2 s4 s8 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s8)
   changed: (driven) from 1953 to 1976
   goals met: 16 of 20
69. (drive-truck truck5 s11 s5 driver3)
   deleted: (at truck5 s11)
   added: (at truck5 s5)
   changed: (driven) from 1976 to 2045
   goals met: 16 of 20
70. (drive-truck truck2 s8 s7 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s7)
   changed: (driven) from 2045 to 2127
   goals met: 17 of 20
71. (disembark-truck driver2 truck2 s7)
   deleted: (driving driver2 truck2)
   added: (at driver2 s7) (empty truck2)
   goals met: 17 of 20
72. (drive-truck truck5 s5 s6 driver3)
   deleted: (at truck5 s5)
   added: (at truck5 s6)
   changed: (driven) from 2127 to 2189
   goals met: 18 of 20
73. (walk driver2 s7 p7-6)
   deleted: (at driver2 s7)
   added: (at driver2 p7-6)
   changed: (walked) from 80 to 107
   goals met: 18 of 20
74. (disembark-truck driver3 truck5 s6)
   deleted: (driving driver3 truck5)
   added: (at driver3 s6) (empty truck5)
   goals met: 18 of 20
75. (walk driver3 s6 p6-4)
   deleted: (at driver3 s6)
   added: (at driver3 p6-4)
   changed: (walked) from 107 to 143
   goals met: 18 of 20
76. (walk driver3 p6-4 s4)
   deleted: (at driver3 p6-4)
   added: (at driver3 s4)
   changed: (walked) from 143 to 242
   goals met: 19 of 20
77. (walk driver2 p7-6 s6)
   deleted: (at driver2 p7-6)
   added: (at driver2 s6)
   changed: (walked) from 242 to 281
   goals met: 19 of 20
78. (walk driver2 s6 p6-4)
   deleted: (at driver2 s6)
   added: (at driver2 p6-4)
   changed: (walked) from 281 to 317
   goals met: 19 of 20
79. (walk driver2 p6-4 s4)
   deleted: (at driver2 p6-4)
   added: (at driver2 s4)
   changed: (walked) from 317 to 416
   goals met: 20 of 20
